MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z256VMP4/mcu.h
#define LLWU_PE1                      (*((volatile uint32_t *)0x4007C000))      // LLWU Pin Enable 1 register (LLWU_PE1)
#define LLWU_PE2                      (*((volatile uint32_t *)0x4007C001))      // LLWU Pin Enable 2 register (LLWU_PE2)
#define LLWU_PE3                      (*((volatile uint32_t *)0x4007C002))      // LLWU Pin Enable 3 register (LLWU_PE3)
#define LLWU_PE4                      (*((volatile uint32_t *)0x4007C003))      // LLWU Pin Enable 4 register (LLWU_PE4)
#define LLWU_ME                       (*((volatile uint32_t *)0x4007C004))      // LLWU Module Enable register (LLWU_ME)
#define LLWU_F1                       (*((volatile uint32_t *)0x4007C005))      // LLWU Flag 1 register (LLWU_F1)
#define LLWU_F2                       (*((volatile uint32_t *)0x4007C006))      // LLWU Flag 2 register (LLWU_F2)
#define LLWU_F3                       (*((volatile uint32_t *)0x4007C007))      // LLWU Flag 3 register (LLWU_F3)
#define LLWU_FILT1                    (*((volatile uint32_t *)0x4007C008))      // LLWU Pin Filter 1 register (LLWU_FILT1)
#define LLWU_FILT2                    (*((volatile uint32_t *)0x4007C009))      // LLWU Pin Filter 2 register (LLWU_FILT2)


//*****************************************************************************
//
// Micro Trace Buffer (MTB) registers
//
//*****************************************************************************

#define MTB_POSITION                  (*((volatile uint32_t *)0xF0000000))      // MTB Position Register
#define MTB_MASTER                    (*((volatile uint32_t *)0xF0000004))      // MTB Master Register
#define MTB_FLOW                      (*((volatile uint32_t *)0xF0000008))      // MTB Flow Register
#define MTB_BASE                      (*((volatile uint32_t *)0xF000000C))      // MTB Base Register
#define MTB_MODECTRL                  (*((volatile uint32_t *)0xF0000F00))      // Integration Mode Control Register
#define MTB_TAGSET                    (*((volatile uint32_t *)0xF0000FA0))      // Claim TAG Set Register
#define MTB_TAGCLEAR                  (*((volatile uint32_t *)0xF0000FA4))      // Claim TAG Clear Register
#define MTB_LOCKACCESS                (*((volatile uint32_t *)0xF0000FB0))      // Lock Access Register
#define MTB_LOCKSTAT                  (*((volatile uint32_t *)0xF0000FB4))      // Lock Status Register
#define MTB_AUTHSTAT                  (*((volatile uint32_t *)0xF0000FB8))      // Authentication Status Register
#define MTB_DEVICEARCH                (*((volatile uint32_t *)0xF0000FBC))      // Device Architecture Register
#define MTB_DEVICECFG                 (*((volatile uint32_t *)0xF0000FC8))      // Device Configuration Register
#define MTB_DEVICETYPID               (*((volatile uint32_t *)0xF0000FCC))      // Device Type Identifier Register
#define MTB_PERIPHID4                 (*((volatile uint32_t *)0xF0000FD0))      // Peripheral ID Register
#define MTB_PERIPHID5                 (*((volatile uint32_t *)0xF0000FD4))      // Peripheral ID Register
#define MTB_PERIPHID6                 (*((volatile uint32_t *)0xF0000FD8))      // Peripheral ID Register
#define MTB_PERIPHID7                 (*((volatile uint32_t *)0xF0000FDC))      // Peripheral ID Register
#define MTB_PERIPHID0                 (*((volatile uint32_t *)0xF0000FE0))      // Peripheral ID Register
#define MTB_PERIPHID1                 (*((volatile uint32_t *)0xF0000FE4))      // Peripheral ID Register
#define MTB_PERIPHID2                 (*((volatile uint32_t *)0xF0000FE8))      // Peripheral ID Register
#define MTB_PERIPHID3                 (*((volatile uint32_t *)0xF0000FEC))      // Peripheral ID Register
#define MTB_COMPID0                   (*((volatile uint32_t *)0xF0000FF0))      // Component ID Register
#define MTB_COMPID1                   (*((volatile uint32_t *)0xF0000FF4))      // Component ID Register
#define MTB_COMPID2                   (*((volatile uint32_t *)0xF0000FF8))      // Component ID Register
#define MTB_COMPID3                   (*((volatile uint32_t *)0xF0000FFC))      // Component ID Register


//*****************************************************************************
//
// Direct Memory Access Multiplexer (DMAMUX) registers
//
//*****************************************************************************

#define DMAMUX0_CHCFG0                (*((volatile uint32_t *)0x40021000))      // Channel Configuration register
#define DMAMUX0_CHCFG1                (*((volatile uint32_t *)0x40021001))      // Channel Configuration register
#define DMAMUX0_CHCFG2                (*((volatile uint32_t *)0x40021002))      // Channel Configuration register
#define DMAMUX0_CHCFG3                (*((volatile uint32_t *)0x40021003))      // Channel Configuration register


//*****************************************************************************
//
// DMA Controller Module registers
//
//*****************************************************************************

#define DMA_SAR0                      (*((volatile uint32_t *)0x40008100))      // Source Address Register
#define DMA_DAR0                      (*((volatile uint32_t *)0x40008104))      // Destination Address Register
#define DMA_DSR_BCR0                  (*((volatile uint32_t *)0x40008108))      // DMA Status Register / Byte Count Register
#define DMA_DCR0                      (*((volatile uint32_t *)0x4000810C))      // DMA Control Register
#define DMA_SAR1                      (*((volatile uint32_t *)0x40008110))      // Source Address Register
#define DMA_DAR1                      (*((volatile uint32_t *)0x40008114))      // Destination Address Register
#define DMA_DSR_BCR1                  (*((volatile uint32_t *)0x40008118))      // DMA Status Register / Byte Count Register
#define DMA_DCR1                      (*((volatile uint32_t *)0x4000811C))      // DMA Control Register
#define DMA_SAR2                      (*((volatile uint32_t *)0x40008120))      // Source Address Register
#define DMA_DAR2                      (*((volatile uint32_t *)0x40008124))      // Destination Address Register
#define DMA_DSR_BCR2                  (*((volatile uint32_t *)0x40008128))      // DMA Status Register / Byte Count Register
#define DMA_DCR2                      (*((volatile uint32_t *)0x4000812C))      // DMA Control Register
#define DMA_SAR3                      (*((volatile uint32_t *)0x40008130))      // Source Address Register
#define DMA_DAR3                      (*((volatile uint32_t *)0x40008134))      // Destination Address Register
#define DMA_DSR_BCR3                  (*((volatile uint32_t *)0x40008138))      // DMA Status Register / Byte Count Register
#define DMA_DCR3                      (*((volatile uint32_t *)0x4000813C))      // DMA Control Register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register (MCG_C1)
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register (MCG_C2)
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register (MCG_C3)
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register (MCG_C4)
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register (MCG_C5)
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register (MCG_C6)
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register (MCG_S)
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register (MCG_SC)
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register (MCG_ATCVH)
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register (MCG_ATCVL)
#define MCG_C7                        (*((volatile uint32_t *)0x4006400C))      // MCG Control 7 Register (MCG_C7)
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register (MCG_C8)
#define MCG_C9                        (*((volatile uint32_t *)0x4006400E))      // MCG Control 9 Register (MCG_C9)
#define MCG_C10                       (*((volatile uint32_t *)0x4006400F))      // MCG Control 10 Register (MCG_C10)


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

